Repository: xdgf558/MindBudget
Catalog: MindBudget/Resources/Localizable.xcstrings
Source language: en
Languages: zh_hans

# settings.ask.enabled
source: Show Ask MindBudget
zh_hans: 显示“问花有数”

# settings.ai.enhancement
source: On-device wording enhancement
zh_hans: 本机文字增强

# settings.ai.fallback
source: Ask and reminders remain fully usable with deterministic templates when enhancement is off or unavailable.
zh_hans: 增强关闭或不可用时，Ask 和提醒仍可通过确定性模板完整使用。

# settings.ai.debugFallbacks
source: Current-session cumulative fallback diagnostics (Debug)
zh_hans: 本次运行累计降级诊断（Debug）

# settings.ai.debug.unavailable
source: Unavailable or disabled
zh_hans: 不可用或已关闭

# settings.ai.debug.timeout
source: Timed out
zh_hans: 请求超时

# settings.ai.debug.validationFailed
source: Safety validation
zh_hans: 安全校验失败

# settings.ai.debug.modelError
source: Model or guardrail error
zh_hans: 模型或护栏错误

# settings.ai.debugValidationDetails
source: Safety validation details
zh_hans: 安全校验详情

# settings.ai.debug.validation.titleTooLong
source: Title too long
zh_hans: 标题过长

# settings.ai.debug.validation.bodyTooLong
source: Body too long
zh_hans: 正文过长

# settings.ai.debug.validation.bannedPhrase
source: Banned wording
zh_hans: 禁用措辞

# settings.ai.debug.validation.noActionableOption
source: No actionable option
zh_hans: 缺少可执行选项

# settings.ai.debug.validation.invalidActionCount
source: Invalid action count
zh_hans: 操作数量无效

# settings.ai.debug.validation.missingContinuePurchase
source: Continue option missing
zh_hans: 缺少继续购买选项

# settings.ai.debug.validation.unknownAction
source: Unknown action
zh_hans: 未知操作

# settings.ai.debug.validation.diagnosis
source: Diagnostic wording
zh_hans: 诊断性措辞

# settings.ai.debug.validation.financialAdvice
source: Financial-advice wording
zh_hans: 财务建议措辞

# settings.ai.debug.validation.imperativeProhibition
source: Purchase prohibition
zh_hans: 禁止购买措辞

# settings.ai.debug.validation.fabricatedNumber
source: Number outside supplied facts
zh_hans: 数字不在已提供事实中

# settings.ai.debug.validation.emptyField
source: Empty title or body
zh_hans: 标题或正文为空

# settings.ai.debug.validation.unexpectedLanguage
source: Unexpected language
zh_hans: 语言与应用设置不符

# settings.ai.privacy
source: Enhancement runs with Apple's on-device model and receives only allow-listed aggregate facts. Questions, notes, and transaction rows are never sent.
zh_hans: 增强使用 Apple 本机模型，仅接收明确允许的聚合事实。问题原文、备注和逐笔记录绝不会发送。

# settings.ai.status.available
source: Apple Intelligence enhancement is available
zh_hans: Apple Intelligence 增强可用

# settings.ai.status.userDisabled
source: Enhancement is off
zh_hans: 增强已关闭

# settings.ai.status.osTooOld
source: Requires iOS 26 or later
zh_hans: 需要 iOS 26 或更高版本

# settings.ai.status.deviceNotEligible
source: Apple Intelligence is not supported on this device
zh_hans: 此设备不支持 Apple Intelligence

# settings.ai.status.appleIntelligenceOff
source: Apple Intelligence is off in System Settings
zh_hans: 系统设置中的 Apple Intelligence 已关闭

# settings.ai.status.modelNotReady
source: The on-device model is not ready yet
zh_hans: 本机模型尚未就绪

# settings.ai.status.languageNotSupported
source: The selected app language is not supported by Apple Intelligence. Choose Follow System or another supported language.
zh_hans: 当前选择的 App 语言暂不支持 Apple Intelligence，可切换为“跟随系统”或其他受支持语言。

# settings.ai.status.buildUnsupported
source: This build does not include on-device enhancement
zh_hans: 当前版本未包含本机增强

# settings.ai.status.unknown
source: Enhancement is currently unavailable
zh_hans: 增强当前不可用

# insights.summary.narrative.title
source: Cycle snapshot
zh_hans: 周期概览

# insights.summary.narrative.body
source: Recorded spending uses %d%% of this cycle's budget. %@ is the leading category by recorded amount.
zh_hans: 已记录消费占本周期预算的 %d%%。%@ 是已记录金额最高的分类。

# insights.summary.narrative.body.lessThanOnePercent
source: Recorded spending uses less than 1%% of this cycle's budget. %@ is the leading category by recorded amount.
zh_hans: 已记录消费占本周期预算不足 1%%。%@ 是已记录金额最高的分类。

# insights.summary.narrative.body.unavailable
source: Recorded spending is available, but this cycle has no budget baseline for a percentage. %@ is the leading category by recorded amount.
zh_hans: 已记录本周期消费，但当前没有可用于计算占比的周期预算基线。%@ 是已记录金额最高的分类。

# insights.summary.noCategory
source: No category
zh_hans: 暂无分类

# settings.integrations.section
source: Siri and Search
zh_hans: Siri 与搜索

# settings.integrations.siri
source: Use with Siri and Shortcuts
zh_hans: 与 Siri 和快捷指令配合使用

# settings.integrations.siri.privacy
source: When you explicitly ask Siri to check budget impact, the authenticated result may speak the exact calculated flexible budget.
zh_hans: 当你主动请 Siri 查看预算影响时，通过认证的结果可能会播报精确的计算后灵活预算。

# settings.integrations.spotlight
source: Show redacted items in Search
zh_hans: 在搜索中显示脱敏项目

# settings.integrations.merchants
source: Include eligible merchant names
zh_hans: 包含符合条件的商户名

# settings.integrations.merchants.detail
source: A merchant appears only when at least one matching expense also allows merchant indexing.
zh_hans: 仅当至少一笔匹配消费也允许商户索引时，该商户才会显示。

# settings.integrations.privacy
source: Both controls are off by default. Search excludes exact amounts and notes. Merchant names remain excluded unless you enable both levels of consent.
zh_hans: 两项功能默认均关闭。搜索不包含精确金额和备注；只有你开启两层授权时才会包含商户名。

# settings.integrations.spotlight.error
source: Search items could not be updated. Your local records are unchanged.
zh_hans: 搜索项目未能更新，本地记录不受影响。

# settings.integrations.spotlight.unavailable
source: Search indexing is unavailable on this device.
zh_hans: 此设备当前无法使用搜索索引。

# intent.error.siriDisabled
source: Siri integration is off in MindBudget settings.
zh_hans: 花有数设置中的 Siri 集成已关闭。

# intent.error.invalidAmount
source: Enter a positive amount.
zh_hans: 请输入正数金额。

# intent.error.amountOutOfRange
source: Enter a smaller amount within MindBudget's supported range.
zh_hans: 请输入花有数支持范围内的金额。

# intent.error.unsupportedPrecision
source: This amount has more decimal places than the selected currency supports.
zh_hans: 该金额的小数位超过了所选币种支持的位数。

# intent.error.unsupportedCurrency
source: That currency is not supported by MindBudget.
zh_hans: 花有数暂不支持该币种。

# intent.error.temporary
source: MindBudget cannot complete this right now. Try again in a moment.
zh_hans: 花有数暂时无法完成此操作，请稍后再试。

# intent.error.invalidText
source: Add a name before continuing.
zh_hans: 请先添加名称。

# intent.error.currencyNotConfigured
source: Finish budget setup in MindBudget before using this action.
zh_hans: 请先在花有数中完成预算设置。

# intent.error.currencyMismatch
source: The requested currency does not match the accounting currency. Confirm the currency in MindBudget.
zh_hans: 请求的币种与记账币种不一致。请在花有数中确认币种。

# intent.error.budgetUnavailable
source: A current confirmed budget is needed for this calculation.
zh_hans: 这项计算需要当前已确认的预算。

# intent.error.itemUnavailable
source: That item is no longer available in the wishlist.
zh_hans: 该项目已不在愿望清单中。

# intent.error.data
source: MindBudget could not read the required local data.
zh_hans: 花有数未能读取所需的本地数据。

# intent.record.title
source: Record Expense
zh_hans: 记录消费

# intent.record.description
source: Records one expense in the configured accounting currency.
zh_hans: 使用已设置的记账币种记录一笔消费。

# intent.record.summary ${amount} ${category}
source: Record ${amount} in ${category}
zh_hans: 在 ${category} 记录 ${amount}

# intent.record.success
source: The expense was recorded.
zh_hans: 消费已记录。

# intent.record.duplicate
source: That expense was already recorded in the last five seconds, so no duplicate was added.
zh_hans: 该消费在过去 5 秒内已记录，因此未重复添加。

# intent.wishlist.add.title
source: Add Wishlist Item
zh_hans: 添加愿望清单项

# intent.wishlist.add.description
source: Adds an item with a default 24-hour cooling-off duration.
zh_hans: 添加一项，默认冷静期时长为 24 小时。

# intent.wishlist.add.summary ${itemName} ${category}
source: Add ${itemName} in ${category}
zh_hans: 将 ${itemName} 添加到 ${category}

# intent.wishlist.add.success
source: The item was added with a 24-hour cooling-off default.
zh_hans: 项目已添加，默认冷静期为 24 小时。

# intent.impact.title
source: Check Budget Impact
zh_hans: 查看预算影响

# intent.impact.description
source: Calculates a candidate purchase without saving its name or amount.
zh_hans: 计算候选购买对预算的影响，不保存其名称或金额。

# intent.impact.summary ${amount} ${category}
source: Check ${amount} in ${category}
zh_hans: 查看 ${category} 中的 ${amount}

# intent.impact.within
source: After this purchase, the calculated flexible budget would be %@.
zh_hans: 这笔购买后，计算得出的灵活预算为 %@。

# intent.impact.over
source: This purchase would take the calculated budget below zero. The flexible budget after it would be %@.
zh_hans: 这笔购买会使计算预算低于零，之后的灵活预算为 %@。

# intent.emotion.title
source: Review Emotional Spending
zh_hans: 回顾情绪消费

# intent.emotion.description
source: Counts recent records with user-selected emotion or reason tags.
zh_hans: 统计近期带有用户自选情绪或原因标签的记录。

# intent.emotion.result
source: There are %d matching records in the last 30 days.
zh_hans: 过去 30 天有 %d 笔匹配记录。

# intent.cooling.title
source: Start Cooling-Off Period
zh_hans: 开始冷静期

# intent.cooling.description
source: Starts a local cooling-off period for a wishlist item.
zh_hans: 为愿望清单项开始本地冷静期。

# intent.cooling.summary ${item} ${durationHours}
source: Start ${durationHours} hours for ${item}
zh_hans: 为 ${item} 开始 ${durationHours} 小时冷静期

# intent.cooling.success.scheduled
source: The cooling-off period was started and its review notification was scheduled.
zh_hans: 冷静期已开始，回看通知已安排。

# intent.cooling.success.local
source: The local cooling-off period was started. No notification was scheduled.
zh_hans: 本地冷静期已开始，未安排通知。

# intent.alternative.title
source: Suggest an Alternative
zh_hans: 建议替代选择

# intent.alternative.description
source: Offers neutral next steps without saving the candidate item name.
zh_hans: 提供中性的下一步选择，不保存候选商品名。

# intent.alternative.result
source: You could add it to the wishlist, start a 24-hour cooling-off period, or revisit it next cycle.
zh_hans: 可以将它加入愿望清单、开始 24 小时冷静期，或下个周期再看。

# intent.pattern.title
source: Find Recent Spending Pattern
zh_hans: 查找近期消费模式

# intent.pattern.description
source: Returns the latest deterministic local insight from the last 30 days.
zh_hans: 返回过去 30 天最新的确定性本地洞察。

# intent.pattern.none
source: No recent stored pattern is available.
zh_hans: 目前没有可用的近期已存储模式。

# intent.pattern.result
source: The latest stored pattern is: %@.
zh_hans: 最新已存储模式是：%@。

# intent.openWishlist.title
source: Open Wishlist Item
zh_hans: 打开愿望清单项

# intent.openWishlist.description
source: Opens a selected wishlist item in MindBudget.
zh_hans: 在花有数中打开选定的愿望清单项。

# intent.openWishlist.summary ${item}
source: Open ${item}
zh_hans: 打开 ${item}

# intent.openDashboard.title
source: Open Budget Dashboard
zh_hans: 打开预算仪表盘

# intent.openDashboard.description
source: Opens the current budget dashboard in MindBudget.
zh_hans: 在花有数中打开当前预算仪表盘。

# intent.parameter.amount
source: Amount
zh_hans: 金额

# intent.parameter.category
source: Category
zh_hans: 分类

# intent.parameter.bucket
source: Budget bucket
zh_hans: 预算桶

# intent.parameter.merchant
source: Merchant name
zh_hans: 商户名

# intent.parameter.currency
source: Currency code
zh_hans: 币种代码

# intent.parameter.itemName
source: Item name
zh_hans: 项目名称

# intent.parameter.estimatedPrice
source: Estimated price
zh_hans: 预估价格

# intent.parameter.emotion
source: Emotion tag
zh_hans: 情绪标签

# intent.parameter.wishlistItem
source: Wishlist item
zh_hans: 愿望清单项

# intent.parameter.durationHours
source: Duration in hours
zh_hans: 时长（小时）

# intent.category.type
source: Expense category
zh_hans: 消费分类

# intent.bucket.type
source: Budget bucket
zh_hans: 预算桶

# shortcut.record
source: Record Expense
zh_hans: 记录消费

# shortcut.impact
source: Check Purchase
zh_hans: 查看购买影响

# shortcut.wishlist
source: Add to Wishlist
zh_hans: 加入愿望清单

# shortcut.emotion
source: Review Emotion Tags
zh_hans: 回顾情绪标签

# shortcut.pattern
source: Recent Pattern
zh_hans: 近期模式

# shortcut.dashboard
source: Open Budget
zh_hans: 打开预算

# entity.expense.type
source: Expense
zh_hans: 消费

# entity.expense.amountBucket.unavailable
source: Amount band unavailable
zh_hans: 暂无金额区间

# entity.expense.amountBucket.underFivePercent
source: Under 5% of that cycle's budget
zh_hans: 低于该周期预算的 5%

# entity.expense.amountBucket.fiveToFifteenPercent
source: 5–15% of that cycle's budget
zh_hans: 该周期预算的 5%–15%

# entity.expense.amountBucket.overFifteenPercent
source: Over 15% of that cycle's budget
zh_hans: 高于该周期预算的 15%

# entity.budget.type
source: Budget snapshot
zh_hans: 预算概览

# entity.budget.current
source: Current budget
zh_hans: 当前预算

# entity.budget.status.current
source: Current cycle calculation
zh_hans: 当前周期计算

# entity.budget.status.over
source: Calculated budget is below zero
zh_hans: 计算预算低于零

# entity.wishlist.type
source: Wishlist item
zh_hans: 愿望清单项

# entity.cooling.type
source: Cooling-off plan
zh_hans: 冷静期计划

# entity.cooling.title
source: Cooling-off review
zh_hans: 冷静期回看

# entity.cooling.status.scheduled
source: Scheduled
zh_hans: 已安排

# entity.cooling.status.active
source: In progress
zh_hans: 进行中

# entity.cooling.status.completed
source: Ready to review
zh_hans: 待回看

# entity.cooling.status.cancelled
source: Ended
zh_hans: 已结束

# entity.merchant.type
source: Eligible merchant
zh_hans: 符合条件的商户

# entity.insight.type
source: Spending insight
zh_hans: 消费洞察

# entity.insight.highSinglePurchase
source: One larger expense
zh_hans: 一笔较大支出

# entity.insight.categoryBudgetRisk
source: Category budget progress
zh_hans: 分类预算进度

# entity.insight.lateNightSpending
source: Late-hour pattern
zh_hans: 较晚时段记录

# entity.insight.repeatedStressSpending
source: Stress-related records
zh_hans: 与压力相关的记录

# entity.insight.imageRelatedIncrease
source: Image-related change
zh_hans: 形象相关支出变化

# entity.insight.impulseCluster
source: Several quick decisions
zh_hans: 几次快速消费决定

# entity.insight.wishlistCoolingOff
source: Wishlist cooling-off
zh_hans: 愿望清单冷静期

# entity.insight.coolingOffSuccess
source: Cooling-off outcome
zh_hans: 冷静期结果

# entity.insight.monthlySummary
source: Cycle summary
zh_hans: 周期总结

# entity.insight.safeToProceed
source: Budget buffer remains
zh_hans: 预算仍有缓冲

# entity.insight.severity.info
source: Information
zh_hans: 信息

# entity.insight.severity.gentle
source: Gentle check-in
zh_hans: 温和提示

# entity.insight.severity.caution
source: Worth reviewing
zh_hans: 值得回看

# entity.insight.severity.high
source: Higher impact
zh_hans: 影响较高

# entity.emotion.type
source: Self-selected emotion tag
zh_hans: 自选情绪标签

# spotlight.expense.title
source: %@ expense
zh_hans: %@消费

# spotlight.keyword.expense
source: expense
zh_hans: 消费

# spotlight.keyword.budget
source: budget
zh_hans: 预算

# spotlight.keyword.wishlist
source: wishlist
zh_hans: 愿望清单

# spotlight.keyword.cooling
source: cooling-off
zh_hans: 冷静期

# spotlight.keyword.merchant
source: merchant
zh_hans: 商户

# spotlight.keyword.insight
source: spending insight
zh_hans: 消费洞察

# spotlight.keyword.emotion
source: emotion tag
zh_hans: 情绪标签

# privacy.appLock.section
source: App lock
zh_hans: 应用锁

# privacy.appLock.toggle
source: Require Face ID
zh_hans: 使用面容 ID 保护

# privacy.appLock.footer
source: MindBudget locks on launch and whenever you return from the background. Face ID is used first; the device passcode remains available as a recovery path.
zh_hans: 花有数会在启动及从后台返回时上锁。解锁时优先使用面容 ID，必要时可用设备密码恢复访问。

# privacy.appLock.unavailable
source: Face ID is not set up on this iPhone. Add a face in iOS Settings before enabling the app lock.
zh_hans: 这台 iPhone 尚未设置面容 ID。请先在系统“设置”中添加面容，再开启应用锁。

# privacy.appLock.authenticating
source: Confirming identity…
zh_hans: 正在验证身份…

# privacy.appLock.authenticationFailed
source: Identity could not be confirmed. The app-lock setting was not changed.
zh_hans: 未能确认身份，应用锁设置没有改变。

# privacy.appLock.enable.reason
source: Confirm your identity to turn on the MindBudget app lock.
zh_hans: 请确认身份以开启花有数应用锁。

# privacy.appLock.disable.reason
source: Confirm your identity to turn off the MindBudget app lock.
zh_hans: 请确认身份以关闭花有数应用锁。

# appLock.authentication.reason
source: Unlock MindBudget to view your local budget records.
zh_hans: 解锁花有数以查看你的本地预算记录。

# appLock.title
source: MindBudget is locked
zh_hans: 花有数已上锁

# appLock.message
source: Confirm your identity to continue.
zh_hans: 请确认身份后继续。

# appLock.authenticating
source: Confirming identity
zh_hans: 正在验证身份

# appLock.unlock
source: Unlock
zh_hans: 解锁

# appLock.error.authenticationFailed
source: MindBudget remains locked. Try again when you are ready.
zh_hans: 花有数仍处于上锁状态，准备好后可再次尝试。

# entry.type.title
source: Record an entry
zh_hans: 记一笔

# entry.type.message
source: Choose whether this is an expense or income.
zh_hans: 选择这笔流水是支出还是收入。

# entry.expense
source: Record expense
zh_hans: 记支出

# entry.income
source: Record income
zh_hans: 记收入

# entry.quickAdd
source: Add entry
zh_hans: 记一笔

# ledger.empty.title
source: No ledger entries yet
zh_hans: 还没有流水

# ledger.empty.message
source: Record your first expense or income when you are ready.
zh_hans: 准备好时，记下第一笔支出或收入。

# ledger.filter.type
source: Entry type
zh_hans: 流水类型

# ledger.type.all
source: All
zh_hans: 全部

# ledger.type.expense
source: Expenses
zh_hans: 支出

# ledger.type.income
source: Income
zh_hans: 收入

# income.add.title
source: Add Income
zh_hans: 记录收入

# income.edit.title
source: Edit Income
zh_hans: 编辑收入

source: Income amount
zh_hans: 收入金额

# income.budget.independent
source: This entry stays in your income history and does not change the budget you set.
zh_hans: 这笔收入会保留在收入流水中，不会自动修改你已设定的预算。

source: Income category
zh_hans: 收入分类

# income.source.optional
source: Source (optional)
zh_hans: 来源（可选）

# income.source
source: Source
zh_hans: 来源

# income.note.optional
source: Note (optional)
zh_hans: 备注（可选）

# income.note
source: Note
zh_hans: 备注

# income.date
source: Received on
zh_hans: 到账时间

source: Income details
zh_hans: 收入详情

# income.detail.title
source: Income
zh_hans: 收入

# income.delete.title
source: Delete this income entry?
zh_hans: 删除这笔收入？

# income.delete.message
source: This removes only this income record and cannot be undone.
zh_hans: 仅会删除这笔收入记录，且无法撤销。

# income.row.prefix
source: Income
zh_hans: 收入

# income.category.salary
source: Salary
zh_hans: 工资

# income.category.bonus
source: Bonus
zh_hans: 奖金

# income.category.freelance
source: Freelance
zh_hans: 自由职业

# income.category.investment
source: Investment
zh_hans: 投资收益

# income.category.gift
source: Gift
zh_hans: 赠予

# income.category.refund
source: Refund
zh_hans: 退款

# income.category.other
source: Other
zh_hans: 其他

# wishlist.limit.available
source: Open wishlist items
zh_hans: 进行中的愿望

# wishlist.limit.reached
source: Five open items reached
zh_hans: 进行中的愿望已满 5 条

# wishlist.error.limitReached
source: You can keep up to five open wishlist items. Finish or archive one before adding another.
zh_hans: 最多可保留 5 条进行中的愿望。请先完成、放弃或归档一条，再添加新的愿望。

# wishlist.error.featureNotYetAvailable
source: This cooling-off option is not available yet. The basic 24-hour period remains available.
zh_hans: 这项冷静期选项暂未开放，基础 24 小时冷静期仍可使用。

# intent.error.wishlistLimitReached
source: Your wishlist already has five open items. Finish or archive one before adding another.
zh_hans: 愿望清单已有 5 条进行中的项目，请先完成或归档一条再添加。

# intent.error.featureNotYetAvailable
source: This Siri action is not available yet. You can still record an expense or check your budget.
zh_hans: 这项 Siri 操作暂未开放，你仍可使用 Siri 记支出或查询预算。

# insights.summary.thirtyDays
source: Last 30 days
zh_hans: 近 30 天

# insights.chart.thirtyDays
source: 30-day trend
zh_hans: 30 天趋势

# insights.savings.title
source: Savings progress
zh_hans: 储蓄进度

# insights.savings.target
source: Total goal
zh_hans: 总目标

# insights.savings.saved
source: Saved
zh_hans: 已储蓄

# insights.savings.remaining
source: Remaining
zh_hans: 剩余金额

# insights.savings.progress
source: Savings goal completion
zh_hans: 储蓄目标完成进度

# insights.savings.percent
source: %d%% complete
zh_hans: 已完成 %d%%

# insights.savings.empty
source: Set a total savings goal in Settings to see progress across budget cycles.
zh_hans: 在设置中建立总储蓄目标后，可在这里查看跨预算周期的进度。

# insights.savings.unavailable
source: Savings progress cannot be read right now. Your spending insights remain available.
zh_hans: 暂时无法读取储蓄进度；其他消费洞察仍可继续查看。

# settings.releaseNotes.dailyRebalancing
source: Today now shows the exact daily amount recalculated from the remaining flexible budget after every entry, with allocation explanations in Budget settings.
zh_hans: “今天还可以花”现会在每次记账后，按剩余灵活预算重新计算当日具体金额；预算设置也会说明分配情况。

# settings.releaseNotes.faceIDLock
source: Optional Face ID app lock protects local budget records on launch and after returning from the background.
zh_hans: 新增可选的面容 ID 应用锁，可在启动及从后台返回时保护本地预算记录。

# settings.releaseNotes.incomeLedger
source: Use any Add entry action to choose expense or income, then record, edit, search, export, and delete exact income entries without changing the budget you set.
zh_hans: 通过任一“记一笔”入口先选择支出或收入；逐笔收入可记录、编辑、搜索、导出和删除，且不会自动修改已设预算。

# settings.releaseNotes.thirtyDayInsights
source: Insights now refreshes after saved entries and when opened, summarizing the latest 30 calendar days with on-device category, emotion, and daily trends.
zh_hans: 洞察现会在记录保存后和每次打开时刷新，并在本机统计最近 30 个日历日的分类、情绪及每日趋势。

# settings.releaseNotes.wishlistLimit
source: The free wishlist supports up to five open items, with the limit enforced consistently in the app and Siri actions.
zh_hans: 免费版愿望清单最多保留 5 条进行中的项目，App 与 Siri 操作会一致执行该上限。

# settings.releaseNotes.independentBudgetInputs
source: Monthly income and spending budget stay independent during setup, so entering income never fills or overwrites the amount you plan to spend.
zh_hans: 首次设置时，月收入与支出预算保持独立；填写收入不会再自动填入或覆盖计划支出金额。

# settings.releaseNotes.insightsPartialData
source: Insights keeps recorded expense totals visible but withholds narratives and pattern cards whenever related cooling-off data cannot be read completely.
zh_hans: 相关冷静期数据无法完整读取时，洞察会继续显示已记录的消费汇总，但不会生成周期叙述或模式卡片。

# settings.releaseNotes.dailyAllowanceDeduction
source: Each flexible expense now reduces today's remaining amount one for one. The value stops at zero and explains when no daily amount is available, used, or exceeded.
zh_hans: 每笔灵活支出现会按原金额扣减“今天还可以花”；最低显示 0，并会说明今日暂无可用额度、已经用完或已经超出。

# settings.releaseNotes.localizedLedgerFilters
source: Log filters now show localized record and budget types instead of internal catalog keys.
zh_hans: 流水筛选现会正确显示本地化的流水类型与预算类型，不再出现内部键名。

# settings.releaseNotes.scrollableExpenseCategories
source: Expense entry now presents every category in one horizontally scrollable selector with an announced selected state.
zh_hans: 支出记账现使用可左右滑动的完整分类选择带，并会读出当前选中状态。

# insights.partialDataUnavailable
source: Some derived insights are unavailable because related local processing could not be completed. Your recorded expense summary is still shown.
zh_hans: 部分派生洞察暂时无法显示，因为相关本地处理未能完整完成；已记录的消费汇总仍可查看。

# settings.language.title
source: App language
zh_hans: 应用语言

# settings.language.section
source: Language
zh_hans: 语言

# settings.language.footer
source: Changes MindBudget without changing the language of your iPhone.
zh_hans: 仅切换花有数的界面语言，不会更改 iPhone 的系统语言。

# settings.language.system
source: Follow System
zh_hans: 跟随系统

# settings.language.zh-Hans
source: Simplified Chinese
zh_hans: 简体中文

# income.allocation.title
source: Allocate this income
zh_hans: 分配这笔收入

# income.allocation.message
source: Optional. A budget allocation goes to the saved budget cycle containing this income date. Savings remain part of the separate total goal.
zh_hans: 可选。预算分配会加入包含这个收入日期的已保存预算周期；储蓄仍计入独立的总目标。

# income.allocation.budget
source: Add to the dated budget cycle
zh_hans: 加入对应日期的预算周期

# income.allocation.savings
source: Count toward savings
zh_hans: 计入储蓄

# income.allocation.cycle.loading
source: Checking the matching budget cycle…
zh_hans: 正在查找对应的预算周期…

# income.allocation.cycle.target
source: Budget allocation target
zh_hans: 预算分配目标周期
